{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "FIR",
    "1": "ID_CARD",
    "2": "CHARGE_SHEET",
    "3": "POLICE_REPORT"
  },
  "initializer_range": 0.02,
  "label2id": {
    "FIR": 0,
    "ID_CARD": 1,
    "CHARGE_SHEET": 2,
    "POLICE_REPORT": 3
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "num_labels": 4,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.30.0",
  "vocab_size": 30522
}